### ✅ Preview environment plan
<details><summary>Expand...</summary>

```HCL
google_project.project: Refreshing state... [id=projects/arikkfir]
google_storage_bucket.arikkfir-devops: Refreshing state... [id=arikkfir-devops]
google_service_account.gha-arikkfir-deployment: Refreshing state... [id=projects/arikkfir/serviceAccounts/gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-deployment["roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=arikkfir/roles/serviceusage.serviceUsageAdmin/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-deployment["roles/container.clusterAdmin"]: Refreshing state... [id=arikkfir/roles/container.clusterAdmin/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_organization_iam_member.gha-arikkfir-deployment["roles/resourcemanager.organizationViewer"]: Refreshing state... [id=468825984716/roles/resourcemanager.organizationViewer/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-deployment["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=arikkfir/roles/iam.serviceAccountAdmin/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_storage_bucket_iam_member.arikkfir-devops-gha-arikkfir-deployment["roles/storage.admin"]: Refreshing state... [id=b/arikkfir-devops/roles/storage.admin/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_storage_bucket_iam_member.arikkfir-devops-gha-arikkfir-deployment["roles/storage.objectAdmin"]: Refreshing state... [id=b/arikkfir-devops/roles/storage.objectAdmin/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_organization_iam_member.gha-arikkfir-deployment["roles/iam.organizationRoleViewer"]: Refreshing state... [id=468825984716/roles/iam.organizationRoleViewer/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-deployment["roles/browser"]: Refreshing state... [id=arikkfir/roles/browser/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-deployment["roles/compute.admin"]: Refreshing state... [id=arikkfir/roles/compute.admin/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-deployment["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=arikkfir/roles/resourcemanager.projectIamAdmin/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_service_account_iam_member.default-compute-gha-arikkfir-deployment-iam-serviceAccountUser: Refreshing state... [id=projects/arikkfir/serviceAccounts/8909046976-compute@developer.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com]
google_service_account.gke-node: Refreshing state... [id=projects/arikkfir/serviceAccounts/gke-node@arikkfir.iam.gserviceaccount.com]
google_service_account.config-connector: Refreshing state... [id=projects/arikkfir/serviceAccounts/config-connector@arikkfir.iam.gserviceaccount.com]
google_project_service.apis["servicemanagement.googleapis.com"]: Refreshing state... [id=arikkfir/servicemanagement.googleapis.com]
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=arikkfir/cloudresourcemanager.googleapis.com]
google_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=arikkfir/pubsub.googleapis.com]
google_project_service.apis["bigquery.googleapis.com"]: Refreshing state... [id=arikkfir/bigquery.googleapis.com]
google_project_service.apis["storage-api.googleapis.com"]: Refreshing state... [id=arikkfir/storage-api.googleapis.com]
google_project_service.apis["dns.googleapis.com"]: Refreshing state... [id=arikkfir/dns.googleapis.com]
google_project_service.apis["containerfilesystem.googleapis.com"]: Refreshing state... [id=arikkfir/containerfilesystem.googleapis.com]
google_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=arikkfir/iamcredentials.googleapis.com]
google_project_service.apis["containerregistry.googleapis.com"]: Refreshing state... [id=arikkfir/containerregistry.googleapis.com]
google_project_service.apis["logging.googleapis.com"]: Refreshing state... [id=arikkfir/logging.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=arikkfir/iam.googleapis.com]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=arikkfir/artifactregistry.googleapis.com]
google_project_service.apis["oslogin.googleapis.com"]: Refreshing state... [id=arikkfir/oslogin.googleapis.com]
google_project_service.apis["serviceusage.googleapis.com"]: Refreshing state... [id=arikkfir/serviceusage.googleapis.com]
google_project_service.apis["cloudbilling.googleapis.com"]: Refreshing state... [id=arikkfir/cloudbilling.googleapis.com]
google_project_service.apis["storage-component.googleapis.com"]: Refreshing state... [id=arikkfir/storage-component.googleapis.com]
google_project_service.apis["bigquerystorage.googleapis.com"]: Refreshing state... [id=arikkfir/bigquerystorage.googleapis.com]
google_project_service.apis["container.googleapis.com"]: Refreshing state... [id=arikkfir/container.googleapis.com]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=arikkfir/compute.googleapis.com]
google_project_service.apis["monitoring.googleapis.com"]: Refreshing state... [id=arikkfir/monitoring.googleapis.com]
google_service_account_iam_member.config_connector_workload_identity: Refreshing state... [id=projects/arikkfir/serviceAccounts/config-connector@arikkfir.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:arikkfir.svc.id.goog[cnrm-system/cnrm-controller-manager]]
google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=arikkfir/secretmanager.googleapis.com]
google_project_iam_member.gke-node["roles/monitoring.metricWriter"]: Refreshing state... [id=arikkfir/roles/monitoring.metricWriter/serviceAccount:gke-node@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gke-node["roles/logging.logWriter"]: Refreshing state... [id=arikkfir/roles/logging.logWriter/serviceAccount:gke-node@arikkfir.iam.gserviceaccount.com]
google_compute_network.gke: Refreshing state... [id=projects/arikkfir/global/networks/gke]
google_compute_subnetwork.gke-subnet: Refreshing state... [id=projects/arikkfir/regions/europe-west3/subnetworks/gke-subnet-europe-west3]
google_container_cluster.primary: Refreshing state... [id=projects/arikkfir/locations/europe-west3-a/clusters/primary]
google_container_node_pool.core-n2-custom-4-7168-pre: Refreshing state... [id=projects/arikkfir/locations/europe-west3-a/clusters/primary/nodePools/core-n2-custom-4-7168-pre]
google_container_node_pool.work-n2-custom-4-5120-pre: Refreshing state... [id=projects/arikkfir/locations/europe-west3-a/clusters/primary/nodePools/work-n2-custom-4-5120-pre]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_container_cluster.primary has changed
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/arikkfir/locations/europe-west3-a/clusters/primary"
        name                        = "primary"
      + resource_labels             = {}
        # (27 unchanged attributes hidden)















        # (15 unchanged blocks hidden)
    }

  # google_container_node_pool.core-n2-custom-4-7168-pre has been deleted
  - resource "google_container_node_pool" "core-n2-custom-4-7168-pre" {
      - cluster            = "primary" -> null
      - id                 = "projects/arikkfir/locations/europe-west3-a/clusters/primary/nodePools/core-n2-custom-4-7168-pre" -> null
      - initial_node_count = 1 -> null
      - location           = "europe-west3-a" -> null
      - name               = "core-n2-custom-4-7168-pre" -> null
      - node_locations     = [] -> null
      - project            = "arikkfir" -> null

      - autoscaling {
          - max_node_count = 3 -> null
          - min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - guest_accelerator = [] -> null
          - labels            = {} -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "n2-custom-4-7168" -> null
          - metadata          = {} -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = true -> null
          - service_account   = "gke-node@arikkfir.iam.gserviceaccount.com" -> null
          - spot              = false -> null
          - taint             = [] -> null

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 3 -> null
          - max_unavailable = 0 -> null
        }
    }

  # google_container_node_pool.work-n2-custom-4-5120-pre has been deleted
  - resource "google_container_node_pool" "work-n2-custom-4-5120-pre" {
      - cluster            = "primary" -> null
      - id                 = "projects/arikkfir/locations/europe-west3-a/clusters/primary/nodePools/work-n2-custom-4-5120-pre" -> null
      - initial_node_count = 0 -> null
      - location           = "europe-west3-a" -> null
      - name               = "work-n2-custom-4-5120-pre" -> null
      - node_locations     = [] -> null
      - project            = "arikkfir" -> null

      - autoscaling {
          - max_node_count = 3 -> null
          - min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - guest_accelerator = [] -> null
          - labels            = {
              - "kfirs.com/workload-nodes" = "true"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "n2-custom-4-5120" -> null
          - metadata          = {} -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = true -> null
          - service_account   = "gke-node@arikkfir.iam.gserviceaccount.com" -> null
          - taint             = [
              - {
                  - effect = "NO_EXECUTE"
                  - key    = "kfirs.com/workload-nodes"
                  - value  = "true"
                },
            ] -> null

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 3 -> null
          - max_unavailable = 0 -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_container_node_pool.core-n2-custom-4-7168-pre will be created
  + resource "google_container_node_pool" "core-n2-custom-4-7168-pre" {
      + cluster                     = "primary"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west3-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "core-n2-custom-4-7168-pre"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "arikkfir"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 3
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config {
          + create_pod_range    = (known after apply)
          + pod_ipv4_cidr_block = (known after apply)
          + pod_range           = (known after apply)
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = "n2-custom-4-7168"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "gke-node@arikkfir.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 3
          + max_unavailable = 0
        }
    }

  # google_container_node_pool.work-n2-custom-4-5120-pre will be created
  + resource "google_container_node_pool" "work-n2-custom-4-5120-pre" {
      + cluster                     = "primary"
      + id                          = (known after apply)
      + initial_node_count          = 0
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west3-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "work-n2-custom-4-5120-pre"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "arikkfir"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 3
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "kfirs.com/workload-nodes" = "true"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n2-custom-4-5120"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "gke-node@arikkfir.iam.gserviceaccount.com"
          + taint             = [
              + {
                  + effect = "NO_EXECUTE"
                  + key    = "kfirs.com/workload-nodes"
                  + value  = "true"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 3
          + max_unavailable = 0
        }
    }

  # google_service_account_iam_member.gke-node_gha-arikkfir-deployment_iam_serviceAccountUser will be created
  + resource "google_service_account_iam_member" "gke-node_gha-arikkfir-deployment_iam_serviceAccountUser" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:gha-arikkfir-deployment@arikkfir.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = "projects/arikkfir/serviceAccounts/gke-node@arikkfir.iam.gserviceaccount.com"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```
</details>